package prv.ferchichi.daftar.api.article;

public class ArticleData {

//	public static final Map<String, ArticleInfoDTO> data = Map.of(
//			"dfaca0fe-a594-44d0-8b37-e571adaee1ba",
//			new ArticleInfoDTO(
//					"dfaca0fe-a594-44d0-8b37-e571adaee1ba",
//					new FilmInfoDTO("Lunana, a Yak in the classroom", "Pawo Choyning Dorji", Short.valueOf((short)2020), List.of("Sherab Dorji", "Pem Zam")), 
//					"معلّم شابّ من بوطان، يضطرّ للتّدريس في آخر الدنيا حتّى لا يحرم من أمل الهجرة", "2022-8-7", Set.of("Drama", "Social", "Comedy", "Slice of life", "Bhutan"), 
//					List.of(
//							"هل تمنحُنا التّقديرَ جدارتُنا به، أم تُرى حصولَنا عليه يلهمنا لأن نصبح أهلا له؟ ثمَّ ما قيمةُ التّقديرِ أصلاً في عالمٍ قدّر المالُ فيه كلَّ شيءٍ بمقادير \"مضبوطة\"؟ يجب أن نرحل مع المخرج پاوو تشويننغ Pawo Choyning بعيدا بعيدا حتّى نتمثّل صورًا فاتنةً لهذه الأسئلة. يجب أن نرحل إلى ما وراء البحار والجبال والأنهار والصحاري، وإلى ما بعد العربات والطرقات والديار. يجب أن نرتفع عاليا عند بوّابة الآلهة، فنخلع أحذيتنا الرّياضيِّة ذوات الماركات العالمية ونستبدلها بنعالٍ بلاستيكيّة خفيفةٍ ومانعةٍ للمياه."
//							), 
//					"من فضلكَ المسْ غدي!",
//					"https://storage.googleapis.com/daftar-articles/lunana-cover.png"),
//			
//			"35822b96-69c9-4e9d-b6a1-ded629b940b7",
//			new ArticleInfoDTO(
//					"35822b96-69c9-4e9d-b6a1-ded629b940b7",
//					new FilmInfoDTO("Coupez!", "Michel Hazanavicius", Short.valueOf((short)2022), List.of("Romain Duris", "Bérénice Bejo", "Grégory Gadebois", "Jean-Pascal Zadi")),
//					"النسخة الفرنسية للفلم اليابانيّ One cut of the dead", "2022-8-1", Set.of("Comedy", "Zombie", "Slasher", "Meta", "French", "Cannes"),
//					List.of(
//						"عند العربِ فنٌّ شعريٌّ جميلٌ يُسمّى المعارضات. وهو أنْ يستعيدَ الشّاعرُ بيتا أو بعضَ بيتٍ لشاعرٍ آخر، فيحتفظَ بوزنه وقافيته وبعضِ صورِه، ثمَّ يزيدُ عليهِ فيولّد معانيَ أخرى جديدة، ويحاول أن يُبرز تفوّقه على من سبقه. وأعتقد أنّ قصيدة \"بانت سعاد\" المعروفة بالبردة، هي أكثر القصائد معارضة، إذ يذكر ابن الأنباري أن أحدهم يحفظ سبعمائة قصيدة تُستهلّ ب\"بانت سعاد\"!"
//					),
//					"اِقطع، لا تقطع!",
//					"https://storage.googleapis.com/daftar-articles/coupez-cover.jpeg"),
//			
//			"4805d3bc-20dd-487d-9524-0a8891385e75",
//			new ArticleInfoDTO(
//					"4805d3bc-20dd-487d-9524-0a8891385e75", 
//					new FilmInfoDTO("Top Gun: Maverick", "Joseph Kosinski", Short.valueOf((short)2022), List.of("Tom Cruise", "Jenniger Connelly")), 
//					"يعود مافرك إلى توپڤن أستاذا هذه المرّة.", "2022-7-17", Set.of("Drama", "Action", "Romance", "American", "Army"), 
//					List.of(
//						"هناك وجهان لتوم كروز. وجهٌ أبيض جامد الابتسامةِ، يشبه بعضُه بعضا كحبّات قطانية (فشار) في قرطاسِها الجاهز للاستهلاك السّينمائيِّ السريـعِ. ووجهٌ حيٌّ صادق المُحيّا لولدٍ يكتشفُ جُزءا من ذاتِه ويشاركنا إيّاهُ. قليلةٌ هي تلك الأعمال الّتي خاطبت أعماق النّجم الأمريكيِّ الشهيرِ فأخرجت أجمل ما فيهِ (عيون مغمضة على اتّساعها Eyes wide shut، مڤنوليا Magnolia) وإنّي لأعتقد أنّ فِلمَيْ توپ-ڤن TopGun من بينها."
//					), 
//					"حَفْلَةُ ٱلذُّكُورَةِ",
//					"https://storage.googleapis.com/daftar-articles/topgunmaverick-cover.jpg"),
//			
//			"155bfe14-d248-468b-98c7-8bbf8be54526",
//			new ArticleInfoDTO(
//					"155bfe14-d248-468b-98c7-8bbf8be54526",
//					new FilmInfoDTO("قُرْبَان", "نجيب بلقاضي", Short.valueOf((short)2021), List.of("نجيب بلقاضي", "سهير بن عمارة")),
//					"مريض نفسيّ يواجه الحجر الصحيّ الشّاملَ بمفرده دون إعداد", "2022-6-30", Set.of("Drama", "Tunisian"),
//					List.of("لا أعرف فنانا تونسيا يتعرَّض إلى سوء فهم منهجيٍّ مثلما يحدث مع نجيب بلقاضي. لا أتحدّث هنا عن إنڤمار برڤمان طبعا، ولكنَّ عالم نجيب بلقاضي السّينمائيِّ أرحبُ من قُمقُمِ الواقعيّةِ الاجتماعيةِ الّتي يريدون حشرَه فيه. \"VHS كحلوشة\" ليس فِلمًا عن الأحياءِ الشَّعبية في سوسة، و\"في عينيّ\" ليس فِلما عن التّوحُّدِ، و\"باستاردو\" لا يعالج مشكلةَ الأحياء العشوائيّةِ ولا قضايا شبكاتِ الاتّصال. وبالمثل، فقُربان ليس فِلمًا عن الحَجْر والكورونا."),
//					"ٱلذَّاتُ وَٱلْقُرْبَانُ",
//					"https://storage.googleapis.com/daftar-articles/communion-cover.jpg"),
//			
//			"faff1a3f-a3eb-427e-85e4-83dce4188dd8",
//			new ArticleInfoDTO(
//					"faff1a3f-a3eb-427e-85e4-83dce4188dd8", 
//					new FilmInfoDTO("فَرْطَطُّو ٱلذّهَبْ", "عبد الحميد بوشناق", Short.valueOf((short)2021), List.of("محمد السويسي", "فتحي الهداوي", "ريان داود")), 
//					"عون بوليس يجد أمام منزله طفلا سيفقد بصره قريبا، فيقرّر أن يأخذه في رحلة ليريه ما لم يره في حياتِه قطّ", "2022-5-30", Set.of("Drama", "Tunisian"), 
//					List.of("عجبتُ ممّا حاق بفِلمِ عبد الحميد بوشناق الأخير من تهليل وإكبار لما وُصف كأوّل فلمِ فانتازيا تونسيٍّ. ليس لأنّ الفانتازيا، وعكس ما يظنّه الناسُ، أكثرُ فنونِ القصصِ في مدوّنتنا العربية منذ حربِ البسوسِ وعنترة إلى قصص ابن المقفع وألف ليلة وليلة. وليس لأنّ بوشناق جاء متأخّرا على قصص عبد العزيز العروي الخارقة ببضعة عقودٍ. ولكن لأنّ فلمَ \"فرططّو الذّهب\" ليس فلمًا عجائبيّا من أساسه!"), 
//					"ٱلْخَوْفُ مِنَ ٱلْفَنْتَازِيَا", 
//					"https://storage.googleapis.com/daftar-articles/goldenbutterfly-cover.png"),
//			
//			"76162b65-c7bb-4eb1-9071-0ca5cd2b946a",
//			new ArticleInfoDTO("76162b65-c7bb-4eb1-9071-0ca5cd2b946a", 
//					new FilmInfoDTO("غُدْوَة", "ظافر العابدين", Short.valueOf((short)2021), List.of("ظافر العابدين", "أحمد عامر")), 
//					"محامٍ يحاول التمسّك بمسار العدالة في زمن تناست فيه تونس الثورة كيف بدأت.", "2022-4-19", Set.of("Drama", "Social", "Politics", "Tunisian"), 
//					List.of("حدثت مفارقة غريبة بين مصر وتونس هذا العام. فبعد أن هوجِم فلمُ \"ريش\" المصريُّ في مهرجان الجونة، وبعد أن اتّهم مخرجُه عمر الزهيري بالإساءة لصورة مِصر منذ فيلمه الأوّل، بادر مهرجان قرطاج لتتويجه بالسّعفة الذهبيّةِ. في الآن ذاتِه لم يقبل في مسابقتِه الرّسميّةِ فِلْمَ ظافر العابدين الأوّلِ، فإذا به يُتوّجُ بجائزة النّقاد في مهرجان القاهرة الدّوليّ ويحظى بتقدير كبير من الجماهير. كلاهما عملٌ أوّل لصاحبه، وكلاهما يقدّم للآخر صورةً محلّيّة مفاجئة. وإذا كان \"ريش\" قد جوبه بسخط اللاّئذين بالنّكران والمستفيدين من معادلة الواقع الظالمة، فهل كان \"غدوة\" أيضا ضحيّةَ ذات الطبقة في تونس، أم تراهُ فلما ضعيفا ما كان من الإنصاف قبوله في المسابقة الرسميّة؟"), 
//					"غُدْوَة، أمْلاً فِي ٱلْحِفَاظِ عَلَى ٱلْأَمْسِ", 
//					"https://storage.googleapis.com/daftar-articles/ghodwa-cover.png")
//					);
}
